In [1]:
import pandas as pd
#인덱스를 숫자로 선언시 지정
s = pd.Series(['banana',42])

In [2]:
s

0    banana
1        42
dtype: object

In [3]:
#인덱스를 문자열로 지정
s = pd.Series(['Wes McKinney','Creator of Pandas'],index=['Person','Who'])
s

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [4]:
scientists = pd.DataFrame({
    'Name':['Rosaline Franklin','Wiliam Gosset'],
    'Occupation' : ['Chemist', 'Statistican'],
    'Born' : ['1920-07-25','1876-06-13'],
    'Died' : ['1958-04-16','1937-10-16'],
    'Age' : [37,61]
})

scientists

                Name   Occupation        Born        Died  Age
0  Rosaline Franklin      Chemist  1920-07-25  1958-04-16   37
1      Wiliam Gosset  Statistican  1876-06-13  1937-10-16   61

In [5]:
from collections import OrderedDict

In [7]:
scientists = pd.DataFrame(OrderedDict([ #딕셔너리인데 순서가 필요할 경우
    ('Name',['Rosaline Franklin','Wiliam Gosset']),
    ('Occupation' , ['Chemist', 'Statistican']),
    ('Born' , ['1920-07-25','1876-06-13']),
    ('Died' , ['1958-04-16','1937-10-16']),
    ('Age' , [37,61])
])
)

scientists

                Name   Occupation        Born        Died  Age
0  Rosaline Franklin      Chemist  1920-07-25  1958-04-16   37
1      Wiliam Gosset  Statistican  1876-06-13  1937-10-16   61

In [9]:
scientists = pd.DataFrame(
    data = {'Name':['Rosaline Franklin','Wiliam Gosset'],
    'Occupation' : ['Chemist', 'Statistican'],
    'Born' : ['1920-07-25','1876-06-13'],
    'Died' : ['1958-04-16','1937-10-16'],
    'Age' : [37,61]},
    index = ['Rosaline Franklin','Wiliam Gosset'],
    columns = ['Occupation','Born','Age','Died']
            
)

scientists

                    Occupation        Born  Age        Died
Rosaline Franklin      Chemist  1920-07-25   37  1958-04-16
Wiliam Gosset      Statistican  1876-06-13   61  1937-10-16

In [10]:
first_row = scientists.loc['Wiliam Gosset']
type(first_row)

pandas.core.series.Series

In [11]:
first_row

Occupation    Statistican
Born           1876-06-13
Age                    61
Died           1937-10-16
Name: Wiliam Gosset, dtype: object

In [12]:
first_row.index

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [13]:
first_row.index[0]

'Occupation'

In [14]:
first_row.values

array(['Statistican', '1876-06-13', 61, '1937-10-16'], dtype=object)

In [15]:
first_row.keys()

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [16]:
ages = scientists['Age']

In [17]:
ages

Rosaline Franklin    37
Wiliam Gosset        61
Name: Age, dtype: int64

In [18]:
ages.mean()

49.0

In [19]:
ages.min()

37

In [20]:
ages.max()

61

In [21]:
ages.std()

16.97056274847714

In [25]:
scientists = pd.read_csv('data2/scientists.csv')
ages = scientists['Age']
print(ages.max())
ages.mean()

90

59.125

### 시리즈 불린추출 - 불린추출이란 참이나 거짓의 불린값을 시리즈에 전달하면 참인 인덱스의 데이터만 추출할 수 있다.
데이터 추출시 인덱스를 지정하여 추출한다. 그러나 추출할 데이터의 인덱스를
  모르는 경우 사용하는 방법이 불린 추출이다.

In [26]:
print(ages > ages.mean())

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [27]:
ages[ages > ages.mean()] ##평균보다 나이가 많은사람 데이터 출력 불린추출

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

## 브로드캐스팅 : 벡터 + 스칼라 연산. 백터의 모든 값에 스칼라 값을 더해준다.

In [28]:
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [29]:
pd.Series([1,100])

0      1
1    100
dtype: int64

In [30]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [31]:
ages + pd.Series([1,100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [34]:
ages.sort_index(ascending=False)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [35]:
ages.sort_values(ascending=False) # 내림차순

2    90
7    77
3    66
1    61
4    56
5    45
6    41
0    37
Name: Age, dtype: int64

## Dataframe 불린추출

In [36]:
scientists[scientists['Age']>scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [40]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [41]:
scientists * 2 #브로드캐스팅
#데이터프레임에 * 2를 하면 정수 데이터는 2를 곱하고 문자열 데이터는 문자열이 두배로 늘어난다.

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

### (3) Series와 DataFrame의 데이터 처리
 
1) 열의 자료형 바꾸기와 새로운 열 추가하기
 - 데이터프레임의 object 타입은 파이썬에서 문자열을 나타낸다.
 - scientists의 Born, Died열의 자료형 확인하고 datetime 자료형으로 변경하여
   새로운 변수에 저장
 - format 속성을 '%Y-%m-%d'로 지정하여 날짜형식을 만든다.

In [44]:
born_datetime = pd.to_datetime(scientists['Born'],format='%Y-%m-%d')
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [46]:
died_datetime = pd.to_datetime(scientists['Died'],format='%Y-%m-%d')
died_datetime

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [47]:
scientists['Name']

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [49]:
scientists['died_dt'] = died_datetime
scientists

,Name,Born,Died,Age,Occupation,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1855-02-23

In [50]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'died_dt'], dtype='object')

## 2) 데이터프레임의 행과 열 삭제하기
- 행과열을 삭제하려면 drop 메서드를 사용해야 한다.
- drop메서드 첫번째 인자는 열이름, 두번째 인자는 axis=1은 칼럼의 레이블을
  의미하고 axis=0은 인덱스를 의미한다.

In [51]:
scientists_dropped = scientists.drop(['Age'],axis =1) # 열방향 컬럼삭제.
scientists_dropped.index

RangeIndex(start=0, stop=8, step=1)

In [52]:
scientists_dropped.columns #Age 삭제

Index(['Name', 'Born', 'Died', 'Occupation', 'died_dt'], dtype='object')

In [53]:
scientists_dropped.index #지우지전 인덱스

RangeIndex(start=0, stop=8, step=1)

In [55]:
scientists_dropped = scientists.drop([0],axis=0) #행방향으로 지움
scientists_dropped.index # 지워진후 인덱스 [0]이없다

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64')

## (4) 데이터 저장하고 불러오기
 - 데이터를 피클, CSV, TSV파일 저장하고 불러오기

 1) 데이터를 피클 저장하기 불러오기
  - 피클은 데이터를 바이너리 형태로 직렬화한 오브젝트를 저장하는 방법이다
    작은용량으로 데이터를 저장할 수 있다. 
  - to_pickle 메서드로 저장하고, read_pickle 메서드로 읽어온다.

In [56]:
names = scientists['Name']
names

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [58]:
names.to_pickle('tmp/scientists_name_series.pickle')

In [59]:
scientists_names_from_pickle = pd.read_pickle('tmp/scientists_name_series.pickle')
scientists_names_from_pickle

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [61]:
scientists.to_pickle('tmp/scientists_df.pickle')
scientists_from_pickle = pd.read_pickle('tmp/scientists_df.pickle')
scientists_from_pickle

,Name,Born,Died,Age,Occupation,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1855-02-23

2) CSV 파일과 TSV 파일로 저장하기
 - 쉼표로 구분하여 저장한 파일이 CSV파일이고, 탭으로 구분하여 저장한 파일이
   TSV 파일이다.
 - to_csv 메소드로 시리즈와 데이터프레임을 CSV파일로 저장할 수 있다.
 - sep인자를 추가하여 '\t'를 지정하고 파일확장자를 '.tsv'로 하면 TSV파일로도
   저장된다.

In [62]:
names.to_csv('tmp/scientist_names_series.csv')

In [64]:
scientists.to_csv('tmp/scientists_df.tsv',sep='\t') #콤마가 아닌 탭으로 구분되어진 형식

In [65]:
scientists.to_csv('tmp/scientists_df_no_index.csv',index=False)

3) 시리즈와 데이터프레임을 엑셀로 저장하기
  - 시리즈는 to_frame으로 데이터프레임으로 변환하여 저장한다.
  - xls로저장하려면 xlwt라이브러리가 필요하고, xlsx파일로 저장하려면
    openpyxl라이브러리가 필요하다.

  - jupyter notebook 에서 라이브러리 설치는 다음과 같다.
    !pip install xlwt
    !pip install openpyxl

In [68]:
names_df = names.to_frame()
names_df

                   Name
0     Rosaline Franklin
1        William Gosset
2  Florence Nightingale
3           Marie Curie
4         Rachel Carson
5             John Snow
6           Alan Turing
7          Johann Gauss

In [69]:
import xlwt

In [70]:
names_df.to_excel('tmp/scientists_names_series_df.xls')

C:\ProgramData\Anaconda3\envs\pydata\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  """Entry point for launching an IPython kernel.

In [71]:
import openpyxl
names_df.to_excel('tmp/scientists_names_series_df.xlsx')